{
  "date": "2025년 04월 25일",
  "horoscope": {
    "chinese_zodiac": {
      "rat": {
        "interpretation": "오늘은 2025년 4월 25일로, 간지의 조합은 을묘(乙卯)로 목(木)의 기운이 강하게 작용합니다. 쥐띠는 수(水)의 기운을 지니고 있어, 목(木)과 수(水)의 관계는 상생의 관계입니다. 그러나 오늘의 목(木) 기운이 지나치게 강해지면 수(水)가 약해질 수 있어, 쥐띠에게는 불리한 상황이 발생할 수 있습니다. 따라서 오늘은 기운이 좋지 않은 상황이 발생할 가능성이 있으며, 특히 대인관계에서의 갈등이나 오해가 생길 수 있습니다. 종합적으로 볼 때, 오늘은 조심스럽게 행동하고, 주변 사람들과의 소통에 신경 써야 할 날입니다.",
        "luck_score": 45,
        "advice": "오늘은 신중하게 행동하고, 대인관계에 주의하세요.",
        "lucky_item": "수분 보충 음료",
        "lucky_color": "파란색",
        "good_time": "오후 3시에서 5시 사이",
        "content": {
          "1996": "오늘은 대인관계에서 오해가 생길 수 있으니, 소통에 주의하세요.",
          "1984": "업무에서의 스트레스가 쌓일 수 있으니, 잠시 휴식을 취하는 것이 좋습니다.",
          "1972": "가족과의 갈등이 예상되니, 대화로 문제를 해결하는 것이 중요합니다.",
          "1960": "건강에 유의해야 할 시점입니다. 충분한 수분 섭취를 잊지 마세요.",
          "1948": "재정적인 문제로 고민할 수 있으니, 지출을 조절하는 것이 필요합니다."
        }
      },
      "ox": {
        "interpretation": "오늘은 2025년 4월 25일로, 乙卯의 날입니다. 乙은 목(木)으로, 오늘의 오행은 목입니다. 소띠는 토(土)로, 목과 토는 상극의 관계에 있습니다. 이는 소띠에게 오늘이 다소 힘든 날이 될 수 있음을 시사합니다. 목의 기운이 소띠의 기운을 약화시킬 수 있으며, 이로 인해 스트레스나 불안감이 증가할 수 있습니다. 그러나 이러한 어려움 속에서도 소띠의 인내와 끈기를 발휘하면 극복할 수 있는 기회가 생길 것입니다. 종합적으로 오늘은 도전과 시련이 예상되지만, 이를 통해 성장할 수 있는 기회가 주어질 수 있습니다.",
        "luck_score": 45,
        "advice": "오늘은 감정을 잘 다스리고, 인내심을 가지세요.",
        "lucky_item": "수첩",
        "lucky_color": "녹색",
        "good_time": "오후 3시에서 5시 사이",
        "content": {
          "1997": "오늘은 친구와의 갈등이 예상되니, 대화로 해결하는 것이 중요합니다.",
          "1985": "직장에서의 스트레스가 클 수 있으니, 잠시 휴식을 취하는 것이 좋습니다.",
          "1973": "가족과의 소통이 원활하지 않을 수 있으니, 먼저 다가가 보세요.",
          "1961": "건강에 유의해야 할 시기입니다. 무리한 활동은 피하세요.",
          "1949": "재정적인 문제로 고민할 수 있으니, 지출을 줄이는 것이 필요합니다."
        }
      },
      "tiger": {
        "interpretation": "오늘은 2025년 4월 25일로, 간지의 조합은 을목(乙木)과 호랑이띠의 오행인 양목(陽木)입니다. 을목은 부드럽고 유연한 성격을 지니며, 호랑이띠의 양목은 강한 기운을 상징합니다. 오늘의 을목은 호랑이띠의 양목과 상생의 관계에 있지만, 지나치게 강한 기운이 서로 충돌할 수 있는 가능성도 내포하고 있습니다. 따라서 오늘은 긍정적인 기운이 흐르지만, 지나친 자신감이나 고집은 오히려 불리하게 작용할 수 있습니다. 종합적으로 보면, 오늘은 기회가 많지만 조심스럽게 접근해야 할 필요가 있습니다.",
        "luck_score": 65,
        "advice": "자신의 의견을 고집하기보다는 유연하게 대처하세요.",
        "lucky_item": "연필",
        "lucky_color": "녹색",
        "good_time": "오후 2시에서 4시 사이",
        "content": {
          "1998": "오늘은 새로운 기회가 생길 가능성이 높습니다. 하지만 신중함이 필요합니다.",
          "1986": "대인관계에서 갈등이 생길 수 있으니, 대화에 주의하세요.",
          "1974": "재정적인 면에서 좋은 소식이 있을 수 있지만, 지출에 주의해야 합니다.",
          "1962": "건강에 유의해야 할 시점입니다. 무리한 운동은 피하세요.",
          "1950": "가족과의 소통이 중요합니다. 작은 다툼이 생길 수 있으니 배려가 필요합니다."
        }
      },
      "rabbit": {
        "interpretation": "오늘은 2025년 4월 25일로, 乙卯(을묘)로 목(木)의 기운이 강하게 작용합니다. 토끼띠는 본래 목의 기운을 지니고 있어, 오늘의 오행과 잘 어울리는 듯 보입니다. 그러나 乙(을)의 기운은 지나치게 부드럽고 유연하여, 때로는 결단력이 부족해질 수 있습니다. 따라서 오늘은 토끼띠가 자신의 의사를 확고히 하지 못하고, 주변의 의견에 휘둘릴 위험이 있습니다. 종합적으로 보면, 오늘은 긍정적인 기운이 흐르지만, 지나친 유연함이 오히려 불리하게 작용할 수 있으니 주의가 필요합니다.",
        "luck_score": 60,
        "advice": "주변의 의견에 휘둘리지 말고, 자신의 결정을 확고히 하세요.",
        "lucky_item": "다이어리",
        "lucky_color": "연두색",
        "good_time": "오후 2시에서 4시 사이",
        "content": {
          "1999": "오늘은 친구와의 관계에서 오해가 생길 수 있으니, 대화에 주의하세요.",
          "1987": "직장에서의 협업이 원활하지 않을 수 있으니, 혼자서도 잘 해낼 수 있는 방법을 모색하세요.",
          "1975": "가족과의 갈등이 예상되니, 대화를 통해 문제를 해결하는 것이 중요합니다.",
          "1963": "재정적인 문제에서 어려움이 있을 수 있으니, 지출을 조절하는 것이 필요합니다.",
          "1951": "건강에 유의해야 할 시점입니다. 무리한 활동은 피하고, 충분한 휴식을 취하세요."
        }
      },
      "dragon": {
        "interpretation": "오늘은 2025년 4월 25일로, 乙卯의 날입니다. 乙은 목(木)으로, 오늘의 오행은 목입니다. 용띠는 본래 토(土)의 기운을 지니고 있어, 목과의 관계는 상생의 관계입니다. 그러나 오늘의 목 기운이 지나치게 강해지면, 용띠의 토 기운이 약해질 수 있어 주의가 필요합니다. 따라서 오늘은 용띠에게 긍정적인 기운이 흐르지만, 지나친 자신감이나 무리한 행동은 오히려 불리할 수 있습니다. 종합적으로 보면, 오늘은 기회가 많지만 조심스럽게 접근해야 하는 날입니다.",
        "luck_score": 65,
        "advice": "자신의 한계를 인식하고 신중하게 행동하세요.",
        "lucky_item": "나무로 만든 소품",
        "lucky_color": "녹색",
        "good_time": "오후 2시에서 4시 사이",
        "content": {
          "2000": "오늘은 새로운 시작을 위한 좋은 기회가 있습니다. 하지만 무리한 계획은 피하세요.",
          "1988": "직장에서의 갈등이 예상되니, 대화로 해결하는 것이 중요합니다.",
          "1976": "가족과의 소통이 원활하지 않을 수 있으니, 배려가 필요합니다.",
          "1964": "건강에 유의해야 할 시점입니다. 스트레스를 줄이는 방법을 찾아보세요.",
          "1952": "재정적인 문제에 주의가 필요합니다. 지출을 줄이는 것이 좋습니다."
        }
      },
      "snake": {
        "interpretation": "오늘은 2025년 4월 25일로, 간지의 조합은 을묘(乙卯)로 목(木)의 기운이 강하게 작용합니다. 뱀띠는 불(火)의 기운을 지니고 있어, 오늘의 목(木)과 불(火)의 관계는 상극입니다. 이는 뱀띠에게 다소 불리한 상황을 초래할 수 있으며, 특히 감정적으로 불안정하거나 갈등이 발생할 가능성이 높습니다. 오늘은 목(木)의 기운이 뱀띠의 불(火)을 억제하므로, 의사소통에서 오해가 생기거나, 계획한 일들이 예상치 못한 방향으로 흘러갈 수 있습니다. 따라서 오늘은 신중하게 행동하고, 감정을 잘 다스리는 것이 중요합니다.",
        "luck_score": 45,
        "advice": "감정을 잘 다스리고 신중하게 행동하세요.",
        "lucky_item": "노트",
        "lucky_color": "녹색",
        "good_time": "오후 3시에서 5시 사이",
        "content": {
          "2001": "오늘은 친구와의 갈등이 예상되니, 대화에 주의하세요.",
          "1989": "직장에서의 불화가 있을 수 있으니, 팀워크를 중시하세요.",
          "1977": "가족과의 소통이 원활하지 않을 수 있으니, 이해심을 가지세요.",
          "1965": "재정적인 문제로 스트레스를 받을 수 있으니, 지출을 조절하세요.",
          "1953": "건강에 유의해야 할 시기입니다. 무리한 활동은 피하세요."
        }
      }
    }
  }
}